/* 
undefined -> 실행된 명령인 console.log("출력 내용");의 결과값을 나타낸다.
console.log()명령은 출력만 할 뿐 반환하지 않는 명령이므로 undefined(정의되지 않음)가 나온 것이다 
*/
var a; // 변수 a
/*
var은 variable(변수)이라는 뜻으로 var a는 변수 a라는 구문이다
쉼표(,)를 이용하면 변수를 여러 개 나열해서 한꺼번에 선언할 수 있다
*/
var a, b, c;
// 자바스크립트에서는 쉼표 다음에 공백(띄어쓰기)을 넣어도 되고넣지 않아도 된다

// 변수를 선언하고 사용하기 전에 초기화라는 작업을 한다
// 초기화란? 변수를선언하고 변수에 처음으로 값을 저장하는 작업

// 변수에 값을 어떻게 저장하는 지? 변수에 값을 저장할 때는 = 연산자를 이용한다
a = 10;
/*
변수 a,b,c를 선언하면 undefined(특별히 존재하지 않는다는 의미)를 표시하지만 변수에 값을
표시한다. 즉 여기서는 10이라는 값을 표시한다
*/
